In [34]:
import pandas as pd
from sklearn.impute import SimpleImputer

# Load the Titanic dataset
df = pd.read_csv('Titanic-Dataset.csv')

# Display the first few rows of the dataset
print("Original Titanic DataFrame:")
df.head()

Original Titanic DataFrame:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
# Checking for missing values in the dataset
print("\nMissing Values in the Dataset:")
print(df.isnull().sum())

Missing Values in the Dataset:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Impute Missing Values**

In [40]:
# Create imputers for numerical and categorical data
num_imputer = SimpleImputer(strategy='mean')
cat_imputer = SimpleImputer(strategy='most_frequent')

In [42]:
# Impute missing values in the 'Age' and 'Fare' columns
df['Age'] = num_imputer.fit_transform(df[['Age']])
df['Fare'] = num_imputer.fit_transform(df[['Fare']])

**Fillna mathod**

In [50]:
# Impute missing values in 'Embarked' and 'Sex' columns using the most frequent value
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df['Sex'] = df['Sex'].fillna(df['Sex'].mode()[0])

In [53]:
# Check that there are no missing values after imputation
print("\nMissing Values After Imputation:")
print(df.isnull().sum())

Missing Values After Imputation:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

Dropping the cabin columns as it's having more than 50% null values in it.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [67]:
df1 = df.drop('Cabin', axis=1)

In [69]:
df1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64